УТ/src/InformationRegisters/ОперацииПроверкиКМ/ОперацииПроверкиКМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОперацииПроверкиКМ</name>
  <resources>
    <name>ЗапросКодаМаркировки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>РезультатПроверкиКМНаККТ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>РезультатПроверкиКМНаСервере</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ФлагиПроверкиОИСМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПокупкаПодтверждена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресСервераЗапросаРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстЗапросаРазрешения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>КодОтветаРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РезультатЗапросаРазрешения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЗапросаРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяЗапросаРазрешения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПродажаРазрешена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаЗапрета</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеСведения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЗапросаЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПодписьЧекаЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВходящееСообщениеЕГАИС</name>
    <type>
      <types>DefinedType.СообщениеЕГАИСвБПО</types>
    </type>
  </resources>
  <resources>
    <name>ИсходящееСообщениеЕГАИС</name>
    <type>
      <types>DefinedType.СообщениеЕГАИСвБПО</types>
    </type>
  </resources>
  <resources>
    <name>СообщениеПереданоЕГАИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибкиЕГАИС</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодМаркировкиПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторСессии</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗапроса</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторФискальнойОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ГодМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодМаркировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>210</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/InformationRegisters/ФискальныеОперации/ФискальныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФискальныеОперации</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияБПО</types>
    </type>
  </resources>
  <resources>
    <name>ТорговыйОбъект</name>
    <type>
      <types>DefinedType.ТорговыйОбъектБПО</types>
    </type>
  </resources>
  <resources>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ТипыФискальныхДокументовККТ</types>
    </type>
  </resources>
  <resources>
    <name>ТипРасчета</name>
    <type>
      <types>EnumRef.ТипыРасчетаДенежнымиСредствами</types>
    </type>
  </resources>
  <resources>
    <name>НомерЧекаККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерСменыККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФискальныйПризнак</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ОплатаНаличные</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ОплатаЭлектронно</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ОплатаПостоплата</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ОплатаПредоплата</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ОплатаВстречноеПредоставление</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>АдресСайтаПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаводскойНомерФН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегистрационныйНомерККТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительныйРеквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КорректируемыйДокумент</name>
    <type>
      <types>DefinedType.ОснованиеФискальнойОперацииБПО</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеXML</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>СубъектПерсональныхДанных</name>
    <type>
      <types>DefinedType.СубъектПерсональныхДанныхБПО</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиныйЧек</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторОплатыПлатежнойСистемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипПлатежнойСистемы</name>
    <type>
      <types>EnumRef.ТипыПлатежнойСистемыККТ</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеФискальнойОперацииБПО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/InformationRegisters/ОперацииПроверкиКМ/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаПроверкиСведенийОТовареПФ = МенеджерОборудованияМаркировкаКлиентСервер.ТаблицаПроверкиСведенийОТовареПФ();
	ТаблицаПроверкиСведенийОТоваре = МенеджерОборудованияМаркировкаКлиентСервер.ТаблицаПроверкиСведенийОТоваре();
	МассивШтрихкодов = Новый Массив();
	Если Не ПустаяСтрока(Запись.ФлагиПроверкиОИСМ) Тогда
		РезультатПроверки = ТаблицаПроверкиСведенийОТовареПФ[Запись.ФлагиПроверкиОИСМ];
		Элементы.РезультатПроверкиОписание.Заголовок = ТаблицаПроверкиСведенийОТоваре[Запись.ФлагиПроверкиОИСМ];
	Иначе
		Элементы.РезультатПроверки.Видимость = Ложь;
		Элементы.РезультатПроверкиОписание.Видимость = Ложь;
	КонецЕсли;
	
	Результат = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(Запись.КодМаркировки, Истина);
	Если Результат.Разобран Тогда
		ТипКода = Результат.ТипИдентификатораТовара;
		КодМаркировкиПредставление = Результат.ПредставлениеШтрихкода;
		Штрихкод = Результат.GTIN;
	Иначе
		ТипКода = Результат.ТипИдентификатораТовара;
		КодМаркировкиПредставление = Запись.КодМаркировки;
		Штрихкод = Запись.КодМаркировки;
	КонецЕсли;
	
	МассивШтрихкодов.Добавить(Штрихкод);
	
	Элементы.РезультатПодтверждениеПокупки.Видимость = Не Запись.ПокупкаПодтверждена;
	
	УстановитьДанныеИзХранилищаЗначений();
	
	Элементы.ФормаСообщениеВТехПоддержку.Видимость = ОбщегоНазначенияБПО.ИспользуетсяСообщенияВСлужбуТехническойПоддержки()
			И ОбщегоНазначенияБПОСлужебныйВызовСервера.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();
			
	Элементы.КодОтветаПредставление.Заголовок = КодОтветаГИСМТПредставление(Запись.КодОтветаРазрешения);
	
	РезультатПроверкиРР = РезультатПроверкиРазрешительногоРежима(Запись.КодОтветаРазрешения, Запись.ПродажаРазрешена);
	РезультатПроверкиЕГАИС = РезультатПроверкиЕГАИС(Запись.Результат, Запись.СообщениеПереданоЕГАИС);
	
	Если КодОтветаАварийнаяСитуация(Запись.КодОтветаРазрешения) Тогда
		Элементы.ГруппаЗапросРазрешения.Видимость = Ложь;
		Элементы.ГруппаИдентификатор.Видимость = Ложь;
		Элементы.ГруппаРезультатЗапросаРазрешения.Видимость = Ложь;
		Элементы.ДекорацияИнформация.Видимость = Истина;
		Элементы.ДекорацияИнформация.Заголовок = НСтр("ru = 'Продажа разрешена в рамках аварийного режима.'");
	Иначе
		Элементы.ГруппаЗапросРазрешения.Видимость = Истина;
		Элементы.ГруппаИдентификатор.Видимость = Истина;
		Элементы.ГруппаРезультатЗапросаРазрешения.Видимость = Истина;
		Элементы.ДекорацияИнформация.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.АдресСервераЗапросаРазрешения.Видимость = Не ПустаяСтрока(Запись.АдресСервераЗапросаРазрешения);
	
	Если Запись.ПродажаРазрешена Или ПустаяСтрока(Запись.ПричинаЗапрета) Тогда
		Элементы.ПричинаЗапрета.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьСтраницИГрупп();
	
	ОбновитьСостояниеФлагаРежимаХраненияУспешныхОпераций();
	
	Если ОбщегоНазначенияБПО.ЭтоМобильнаяПлатформа() Тогда
		Элементы.ДекорацияРежимХраненияУспешныхОпераций.Гиперссылка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяСообщенияВСлужбуТехническойПоддержки() Тогда
		МодульСообщенияВСлужбуТехническойПоддержкиБПОКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержкиБПОКлиент");
		Элементы.ФормаСообщениеВТехПоддержку.Видимость = МодульСообщенияВСлужбуТехническойПоддержкиБПОКлиент.ОтправлятьСообщенияВТехПоддержку();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// Вставить содержимое обработчика.
	Если ИмяСобытия = "Запись_НаборКонстант" 
		И Источник = "ХранитьУспешныеОперацииРазрешения" Тогда
		ОбновитьСостояниеФлагаРежимаХраненияУспешныхОпераций();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СообщениеВТехПоддержку(Команда)
	
	МодульСообщенияВСлужбуТехническойПоддержкиБПОКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержкиБПОКлиент");
	ПараметрыСообщения = МодульСообщенияВСлужбуТехническойПоддержкиБПОКлиент.ПараметрыОтправкиСообщенияОбОшибке();
	ПараметрыСообщения.ДополнительныеДанные = СведенияДляТехподдержки();
	
	
	ПараметрыСообщения.ТекстОшибки = НСтр("ru = 'Информация о проверке контрольной марки для тех.поддержки'");
	ОписаниеОповещения = Новый ОписаниеОповещения("СообщениеВТехническуюПоддержкуЗавершение", ЭтотОбъект);
	МодульСообщенияВСлужбуТехническойПоддержкиБПОКлиент.НачатьОтправкуСообщенияОбОшибке(ОписаниеОповещения, ПараметрыСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СведенияДляТехподдержки()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Структура();
	Для каждого Измерение Из Метаданные.РегистрыСведений.ОперацииПроверкиКМ.Измерения Цикл
		Значение = Запись[Измерение.Имя];
		Результат.Вставить(Измерение.Имя, Значение);
	КонецЦикла;
	Для каждого Ресурс Из Метаданные.РегистрыСведений.ОперацииПроверкиКМ.Ресурсы Цикл
		Если Ресурс.Тип.СодержитТип(Тип("ХранилищеЗначения")) Тогда
			Продолжить;
		КонецЕсли;
		Значение = Запись[Ресурс.Имя];
		Результат.Вставить(Ресурс.Имя, Значение);
	КонецЦикла;
	Для каждого Реквизит Из Метаданные.РегистрыСведений.ОперацииПроверкиКМ.Реквизиты Цикл
		Если Реквизит.Тип.СодержитТип(Тип("ХранилищеЗначения")) Тогда
			Продолжить;
		КонецЕсли;
		Значение = Запись[Реквизит.Имя];
		Результат.Вставить(Измерение.Имя, Значение);
	КонецЦикла;
	Результат.Вставить("ЗапросКодаМаркировки", ЗапросКМ);
	Результат.Вставить("РезультатПроверкиКМНаККТ", РезультатПроверкиНаККТ);
	Результат.Вставить("РезультатПроверкиКМНаСервере", РезультатПроверкиНаСервере);
	Результат.Вставить("РезультатЗапросаРазрешения", РезультатЗапросаРазрешения);
	Результат.Вставить("ВходящееСообщениеЕГАИС", ТекстВходящегоСообщенияЕГАИС);
	Результат.Вставить("ИсходящееСообщениеЕГАИС", ТекстИсходящегоСообщенияЕГАИС);
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьДанныеИзХранилищаЗначений()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОперацииПроверкиКМ.ЗапросКодаМаркировки КАК ЗапросКодаМаркировки,
		|	ОперацииПроверкиКМ.РезультатПроверкиКМНаККТ КАК РезультатПроверкиКМНаККТ,
		|	ОперацииПроверкиКМ.РезультатПроверкиКМНаСервере КАК РезультатПроверкиКМНаСервере,
		|	ФискальныеОперации.ДокументОснование КАК ДокументОснование,
		|	ФискальныеОперации.Дата КАК Дата,
		|	ФискальныеОперации.НомерЧекаККМ КАК НомерЧекаККМ,
		|	ОперацииПроверкиКМ.РезультатЗапросаРазрешения КАК РезультатЗапросаРазрешения,
		|	ОперацииПроверкиКМ.ТекстЗапросаРазрешения КАК ТекстЗапросаРазрешения,
		|	ОперацииПроверкиКМ.ВходящееСообщениеЕГАИС КАК ВходящееСообщениеЕГАИС,
		|	ОперацииПроверкиКМ.ИсходящееСообщениеЕГАИС КАК ИсходящееСообщениеЕГАИС,
		|	ОперацииПроверкиКМ.ДополнительныеСведения
		|ИЗ
		|	РегистрСведений.ОперацииПроверкиКМ КАК ОперацииПроверкиКМ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
		|		ПО ОперацииПроверкиКМ.ИдентификаторФискальнойОперации = ФискальныеОперации.ИдентификаторЗаписи
		|ГДЕ
		|	ОперацииПроверкиКМ.ИдентификаторСессии = &ИдентификаторСессии
		|	И ОперацииПроверкиКМ.ИдентификаторЗапроса = &ИдентификаторЗапроса";
	
	Запрос.УстановитьПараметр("ИдентификаторЗапроса", Запись.ИдентификаторЗапроса);
	Запрос.УстановитьПараметр("ИдентификаторСессии", Запись.ИдентификаторСессии);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ЗапросКМ = Выборка.ЗапросКодаМаркировки.Получить();
	РезультатПроверкиНаККТ = Выборка.РезультатПроверкиКМНаККТ.Получить();
	РезультатПроверкиНаСервере = Выборка.РезультатПроверкиКМНаСервере.Получить();
	
	РезультатЗапросаРазрешения = ОбщегоНазначенияБПО.ФорматироватьJSON(Выборка.РезультатЗапросаРазрешения.Получить());
	ТекстЗапросаРазрешения = ОбщегоНазначенияБПО.ФорматироватьJSON(Выборка.ТекстЗапросаРазрешения.Получить());
	
	ДополнительныеСведения = Выборка.ДополнительныеСведения.Получить();
	ВывестиДополнительныеСведения(ДополнительныеСведения);
	
	ДокументОснование = Выборка.ДокументОснование;
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Элементы.ДокументОснование.Видимость = Ложь;
	КонецЕсли;
	ФискальнаяОперация = Запись.ИдентификаторФискальнойОперации;
	Если ЗначениеЗаполнено(Выборка.Дата) Тогда
		ФискальнаяОперацияПредставление = 
			СтрШаблон(НСтр("ru = '%1 от %2'"), Выборка.НомерЧекаККМ, Формат(Выборка.Дата, НСтр("ru = 'ДЛФ=DT'")));
	Иначе
		Элементы.ФискальнаяОперацияПредставление.Видимость = Ложь;
	КонецЕсли;
	
	Если ОбщегоНазначенияБПО.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		
		МодульРаботаСФайлами = ОбщегоНазначенияБПО.ОбщийМодуль("РаботаСФайлами");
		Если ЗначениеЗаполнено(Выборка.ВходящееСообщениеЕГАИС) Тогда
			ВходящееСообщениеЕГАИС = МодульРаботаСФайлами.ДанныеФайла(Выборка.ВходящееСообщениеЕГАИС);
			ВходящиеДвоичныеДанные = ПолучитьИзВременногоХранилища(ВходящееСообщениеЕГАИС.СсылкаНаДвоичныеДанныеФайла);
			ТекстВходящегоСообщенияЕГАИС = ПолучитьСтрокуИзДвоичныхДанных(ВходящиеДвоичныеДанные);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ИсходящееСообщениеЕГАИС) Тогда
			ИсходящееСообщениеЕГАИС = МодульРаботаСФайлами.ДанныеФайла(Выборка.ИсходящееСообщениеЕГАИС);
			ИсходящиеДвоичныеДанные = ПолучитьИзВременногоХранилища(ИсходящееСообщениеЕГАИС.СсылкаНаДвоичныеДанныеФайла);
			ТекстИсходящегоСообщенияЕГАИС = ПолучитьСтрокуИзДвоичныхДанных(ИсходящиеДвоичныеДанные);
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КлючФискальнойОперации(ИдентификаторЗаписи)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ФискальныеОперации.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
		|ГДЕ
		|	ФискальныеОперации.ИдентификаторЗаписи = &ИдентификаторЗаписи";
	
	Запрос.УстановитьПараметр("ИдентификаторЗаписи", ИдентификаторЗаписи);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();

	Ключ = Новый Структура();
	Ключ.Вставить("ДокументОснование", Выборка.ДокументОснование);
	Ключ.Вставить("ИдентификаторЗаписи", ИдентификаторЗаписи);
	Возврат РегистрыСведений.ФискальныеОперации.СоздатьКлючЗаписи(Ключ);
	
КонецФункции

&НаКлиенте
Процедура ФискальнаяОперацияПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	Ключ = КлючФискальнойОперации(Запись.ИдентификаторФискальнойОперации);
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Ключ) Тогда
		ОткрытьФорму("РегистрСведений.ФискальныеОперации.ФормаЗаписи", Новый Структура("Ключ", Ключ));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СообщениеВТехническуюПоддержкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ПустаяСтрока(Результат.КодОшибки) Тогда
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(Результат.СообщениеОбОшибке);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция КодОтветаГИСМТПредставление(КодОтвета)
	
	ТаблицаРезультатов = Новый Соответствие();
	ТаблицаРезультатов.Вставить(Неопределено, "");  //@NON-NLS-1 @NON-NLS-2
	ТаблицаРезультатов.Вставить("", "");  //@NON-NLS-1 @NON-NLS-2
	ТаблицаРезультатов.Вставить(НСтр("ru = 'Таймаут'"), НСтр("ru = 'Вышло время ожидания запроса на сервере Честного знака'"));  //@NON-NLS-1 @NON-NLS-2
	ТаблицаРезультатов.Вставить("200", НСтр("ru = 'Успешно'"));  //@NON-NLS-1 @NON-NLS-2
	ТаблицаРезультатов.Вставить("401", НСтр("ru = 'Ошибка авторизации'"));  //@NON-NLS-1 @NON-NLS-2
	ТаблицаРезультатов.Вставить("203", НСтр("ru = 'Аварийная ситуация'"));  //@NON-NLS-1 @NON-NLS-2
	ТаблицаРезультатов.Вставить("429", НСтр("ru = 'Не доступна'"));  //@NON-NLS-1 @NON-NLS-2
	КодОтветаПредставление = ТаблицаРезультатов[КодОтвета];
	Если КодОтветаПредставление = Неопределено Тогда
		КодОтветаПредставление = НСтр("ru = 'Ошибка'")
	КонецЕсли;
	Возврат КодОтветаПредставление;
	
КонецФункции

&НаСервереБезКонтекста
Функция КодОтветаАварийнаяСитуация(КодОтвета)
	Возврат КодОтвета = "203";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РезультатПроверкиРазрешительногоРежима(КодОтвета, ПродажаРазрешена)
	
	Результат = "";
	
	Если КодОтвета = Неопределено 
		Или ВРег(КодОтвета) = ВРег(НСтр("ru = 'Таймаут'")) 
		Или КодОтветаАварийнаяСитуация(КодОтвета) Тогда
		Результат = НСтр("ru = 'Проверка не выполнена.'");
	ИначеЕсли СтрНачинаетсяС(КодОтвета, "2") Тогда
		Результат = НСтр("ru = 'Проверка выполнена.'");
	ИначеЕсли ПустаяСтрока(КодОтвета) Тогда
		Результат = НСтр("ru = 'Не выполнялось.'");
	Иначе
		Результат = НСтр("ru = 'Проверка не выполнена.'");
	КонецЕсли;
	
	Если ПродажаРазрешена Тогда
		Результат = Результат + " " + НСтр("ru = 'Продажа разрешена.'")
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РезультатПроверкиЕГАИС(Результат, СообщениеПередано)
	
	Если Результат Тогда
		Если СообщениеПередано Тогда
			Возврат НСтр("ru = 'Сообщение передано.'");
		Иначе
			Возврат НСтр("ru = 'Сообщение не передано.'");
		КонецЕсли;
	Иначе
		Возврат НСтр("ru = 'Ошибка отправки.'");
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьСтраницИГрупп()
	
	ЕстьЕГАИС = ЗначениеЗаполнено(Запись.ИдентификаторЗапросаЕГАИС);
	ЕстьУведомительныйРежим = ЗначениеЗаполнено(ЗапросКМ);
	ЕстьРазрешительныйРежим = ЗначениеЗаполнено(Запись.АдресСервераЗапросаРазрешения) 
		Или ЗначениеЗаполнено(ТекстЗапросаРазрешения)
		Или ЗначениеЗаполнено(РезультатЗапросаРазрешения);
	
	Элементы.СтраницаУведомительныйРежим.Видимость = ЕстьУведомительныйРежим;
	Элементы.СтраницаРазрешительныйРежим.Видимость = ЕстьРазрешительныйРежим;
	Элементы.СтраницаЕГАИС.Видимость = ЕстьЕГАИС;
	Элементы.ГруппаЕГАИС.Видимость = ЕстьЕГАИС;
	
	Элементы.ГруппаУведомительныйРежим.Видимость = ЕстьУведомительныйРежим;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиДополнительныеСведения(ДополнительныеСведения)
	
	Если ТипЗнч(ДополнительныеСведения) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыДляДобавления = Новый Массив;
	ЗначенияДляОбработки = Новый Массив;
	Для Каждого Сведение Из ДополнительныеСведения Цикл
		Идентификатор = СтрЗаменить(Новый УникальныйИдентификатор(),"-","");
		ИмяРеквизита = "Сведение" + Идентификатор;
		ИмяЭлемента = "Элемент"+Идентификатор;
		Реквизит = Новый РеквизитФормы(
			ИмяРеквизита, Новый ОписаниеТипов("Строка"), , Сведение.Заголовок);
		РеквизитыДляДобавления.Добавить(Реквизит);
		Значение = Новый Структура;
		Значение.Вставить("ИмяРеквизита", ИмяРеквизита);
		Значение.Вставить("ИмяЭлемента", ИмяЭлемента);
		Значение.Вставить("Заголовок", Сведение.Заголовок);
		Значение.Вставить("Значение", Сведение.Значение);
		ЗначенияДляОбработки.Добавить(Значение);
	КонецЦикла;
	ИзменитьРеквизиты(РеквизитыДляДобавления);
	
	Для Каждого Значение Из ЗначенияДляОбработки Цикл
		ЭтотОбъект[Значение.ИмяРеквизита] = Значение.Значение;
		
		Элемент = Элементы.Добавить(Значение.ИмяЭлемента, Тип("ПолеФормы"), Элементы.ГруппаРазрешительныйРежим);
		Элемент.Вид = ВидПоляФормы.ПолеНадписи;
		Элемент.Заголовок = Значение.Заголовок;
		Элемент.ПутьКДанным = Значение.ИмяРеквизита;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРежимХраненияУспешныхОперацийНажатие(Элемент)
	
	// ++ НеМобильноеПриложение
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимОткрытия", "ХранениеУспешныхОпераций");
	ОткрытьФорму("Обработка.ПанельАдминистрированияБПО.Форма", ПараметрыОткрытия);
	// -- НеМобильноеПриложение
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеФлагаРежимаХраненияУспешныхОпераций()
		
	ВключеноХранениеУспешныхОпераций = Константы.ХранитьУспешныеОперацииРазрешения.Получить();
	Текст = НСтр("ru = 'Хранение лога успешных операций запроса УР и РР %1.'");
	
	Если ВключеноХранениеУспешныхОпераций Тогда
		Текст = СтрШаблон(Текст, НСтр("ru = 'включено'"));
	Иначе
		Текст = СтрШаблон(Текст, НСтр("ru = 'отключено'"));
	КонецЕсли;
	Элементы.ДекорацияРежимХраненияУспешныхОпераций.Заголовок = Текст;
	
КонецПроцедуры

#КонецОбласти
